tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf13k50_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF13K50_H_
#define _PIC18LF13K50_H_

#define UEP0                          0
#define UEP0_EPSTALL                  1
#define EP0STALL                      2
#define EPSTALL0                      3
#define UEP0_EPINEN                   4
#define EPINEN0                       5
#define EP0INEN                       6
#define UEP0_EPOUTEN                  7
#define EP0OUTEN                      8
#define EPOUTEN0                      9
#define EPCONDIS0                     10
#define EP0CONDIS                     11
#define UEP0_EPCONDIS                 12
#define UEP0_EPHSHK                   13
#define EP0HSHK                       14
#define EPHSHK0                       15
#define UEP1                          16
#define EPSTALL1                      17
#define EP1STALL                      18
#define UEP1_EPSTALL                  19
#define EPINEN1                       20
#define EP1INEN                       21
#define UEP1_EPINEN                   22
#define EPOUTEN1                      23
#define UEP1_EPOUTEN                  24
#define EP1OUTEN                      25
#define UEP1_EPCONDIS                 26
#define EP1CONDIS                     27
#define EPCONDIS1                     28
#define EPHSHK1                       29
#define EP1HSHK                       30
#define UEP1_EPHSHK                   31
#define UEP2                          32
#define EP2STALL                      33
#define EPSTALL2                      34
#define UEP2_EPSTALL                  35
#define EP2INEN                       36
#define EPINEN2                       37
#define UEP2_EPINEN                   38
#define EP2OUTEN                      39
#define UEP2_EPOUTEN                  40
#define EPOUTEN2                      41
#define EP2CONDIS                     42
#define UEP2_EPCONDIS                 43
#define EPCONDIS2                     44
#define EP2HSHK                       45
#define EPHSHK2                       46
#define UEP2_EPHSHK                   47
#define UEP3                          48
#define UEP3_EPSTALL                  49
#define EPSTALL3                      50
#define EP3STALL                      51
#define UEP3_EPINEN                   52
#define EPINEN3                       53
#define EP3INEN                       54
#define EP3OUTEN                      55
#define EPOUTEN3                      56
#define UEP3_EPOUTEN                  57
#define UEP3_EPCONDIS                 58
#define EP3CONDIS                     59
#define EPCONDIS3                     60
#define EPHSHK3                       61
#define UEP3_EPHSHK                   62
#define EP3HSHK                       63
#define UEP4                          64
#define EP4STALL                      65
#define EPSTALL4                      66
#define UEP4_EPSTALL                  67
#define UEP4_EPINEN                   68
#define EP4INEN                       69
#define EPINEN4                       70
#define UEP4_EPOUTEN                  71
#define EPOUTEN4                      72
#define EP4OUTEN                      73
#define EPCONDIS4                     74
#define EP4CONDIS                     75
#define UEP4_EPCONDIS                 76
#define EPHSHK4                       77
#define EP4HSHK                       78
#define UEP4_EPHSHK                   79
#define UEP5                          80
#define EP5STALL                      81
#define UEP5_EPSTALL                  82
#define EPSTALL5                      83
#define EPINEN5                       84
#define UEP5_EPINEN                   85
#define EP5INEN                       86
#define EPOUTEN5                      87
#define UEP5_EPOUTEN                  88
#define EP5OUTEN                      89
#define EPCONDIS5                     90
#define EP5CONDIS                     91
#define UEP5_EPCONDIS                 92
#define UEP5_EPHSHK                   93
#define EPHSHK5                       94
#define EP5HSHK                       95
#define UEP6                          96
#define EPSTALL6                      97
#define UEP6_EPSTALL                  98
#define EP6STALL                      99
#define EP6INEN                       100
#define UEP6_EPINEN                   101
#define EPINEN6                       102
#define EP6OUTEN                      103
#define EPOUTEN6                      104
#define UEP6_EPOUTEN                  105
#define UEP6_EPCONDIS                 106
#define EP6CONDIS                     107
#define EPCONDIS6                     108
#define EPHSHK6                       109
#define UEP6_EPHSHK                   110
#define EP6HSHK                       111
#define UEP7                          112
#define UEP7_EPSTALL                  113
#define EP7STALL                      114
#define EPSTALL7                      115
#define EP7INEN                       116
#define EPINEN7                       117
#define UEP7_EPINEN                   118
#define EP7OUTEN                      119
#define UEP7_EPOUTEN                  120
#define EPOUTEN7                      121
#define UEP7_EPCONDIS                 122
#define EP7CONDIS                     123
#define EPCONDIS7                     124
#define EPHSHK7                       125
#define UEP7_EPHSHK                   126
#define EP7HSHK                       127
#define UEIE                          128
#define PIDEE                         129
#define CRC5EE                        130
#define CRC16EE                       131
#define DFN8EE                        132
#define BTOEE                         133
#define BTSEE                         134
#define UADDR                         135
#define ADDR                          136
#define ADDR0                         137
#define ADDR1                         138
#define ADDR2                         139
#define ADDR3                         140
#define ADDR4                         141
#define ADDR5                         142
#define ADDR6                         143
#define UFRML                         144
#define FRML                          145
#define FRM0                          146
#define FRM1                          147
#define FRM2                          148
#define FRM3                          149
#define FRM4                          150
#define FRM5                          151
#define FRM6                          152
#define FRM7                          153
#define UFRMH                         154
#define FRM8                          155
#define FRMH                          156
#define FRM9                          157
#define FRM10                         158
#define UEIR                          159
#define PIDEF                         160
#define CRC5EF                        161
#define CRC16EF                       162
#define DFN8EF                        163
#define BTOEF                         164
#define BTSEF                         165
#define UIE                           166
#define URSTIE                        167
#define UERRIE                        168
#define ACTVIE                        169
#define TRNIE                         170
#define IDLEIE                        171
#define STALLIE                       172
#define SOFIE                         173
#define UCFG                          174
#define UPP0                          175
#define PPB0                          176
#define UPP1                          177
#define PPB1                          178
#define FSEN                          179
#define UPUEN                         180
#define UTEYE                         181
#define UIR                           182
#define URSTIF                        183
#define UERRIF                        184
#define ACTVIF                        185
#define TRNIF                         186
#define IDLEIF                        187
#define STALLIF                       188
#define SOFIF                         189
#define USTAT                         190
#define PPBI                          191
#define DIR                           192
#define ENDP0                         193
#define ENDP1                         194
#define ENDP2                         195
#define ENDP3                         196
#define UCON                          197
#define SUSPND                        198
#define RESUME                        199
#define USBEN                         200
#define PKTDIS                        201
#define SE0                           202
#define PPBRST                        203
#define SRCON0                        204
#define SRPR                          205
#define SRPS                          206
#define SRNQEN                        207
#define SRQEN                         208
#define SRCLK0                        209
#define SRCLK                         210
#define SRCLK1                        211
#define SRCLK2                        212
#define SRLEN                         213
#define SRCON1                        214
#define SRRC1E                        215
#define SRRC2E                        216
#define SRRCKE                        217
#define SRRPE                         218
#define SRSC1E                        219
#define SRSC2E                        220
#define SRSCKE                        221
#define SRSPE                         222
#define CM2CON0                       223
#define C2CH0                         224
#define C2CH                          225
#define C2CH1                         226
#define C2R                           227
#define C2SP                          228
#define C2POL                         229
#define C2OE                          230
#define C2OUT                         231
#define C2ON                          232
#define CM2CON1                       233
#define C2SYNC                        234
#define C1SYNC                        235
#define C2HYS                         236
#define C1HYS                         237
#define C2RSEL                        238
#define C1RSEL                        239
#define MC2OUT                        240
#define MC1OUT                        241
#define CM1CON0                       242
#define C1CH                          243
#define C1CH0                         244
#define C1CH1                         245
#define C1R                           246
#define C1SP                          247
#define C1POL                         248
#define C1OE                          249
#define C1OUT                         250
#define C1ON                          251
#define SSPMSK                        252
#define MSK0                          253
#define MSK                           254
#define MSK1                          255
#define MSK2                          256
#define MSK3                          257
#define MSK4                          258
#define MSK5                          259
#define MSK6                          260
#define MSK7                          261
#define SLRCON                        262
#define SLRA                          263
#define SLRB                          264
#define SLRC                          265
#define WPUA                          266
#define WPUA3                         267
#define WPUA4                         268
#define WPUA5                         269
#define WPUB                          270
#define WPUB4                         271
#define WPUB5                         272
#define WPUB6                         273
#define WPUB7                         274
#define IOCA                          275
#define IOCA0                         276
#define IOCA1                         277
#define IOCA3                         278
#define IOCA4                         279
#define IOCA5                         280
#define IOCB                          281
#define IOCB4                         282
#define IOCB5                         283
#define IOCB6                         284
#define IOCB7                         285
#define ANSEL                         286
#define ANS3                          287
#define ANS4                          288
#define ANS5                          289
#define ANS6                          290
#define ANS7                          291
#define ANSELH                        292
#define ANS8                          293
#define ANS9                          294
#define ANS10                         295
#define ANS11                         296
#define PORTA                         297
#define ULPWUIN                       298
#define RA0                           299
#define RA1                           300
#define RA3                           301
#define PORTA_RA4                     302
#define CLKOUT                        303
#define AN3                           304
#define OSC2                          305
#define CLKIN                         306
#define LVDIN                         307
#define PORTA_RA5                     308
#define OSC1                          309
#define PORTB                         310
#define SDA                           311
#define AN10                          312
#define SDI                           313
#define PORTB_RB4                     314
#define RX                            315
#define PORTB_RB5                     316
#define AN11                          317
#define DT                            318
#define SCL                           319
#define SCK                           320
#define PORTB_RB6                     321
#define CK                            322
#define PORTB_RB7                     323
#define TX                            324
#define PORTC                         325
#define PORTC_RC0                     326
#define INT0                          327
#define C12INP                        328
#define VREFP                         329
#define AN4                           330
#define AN5                           331
#define CCP2                          332
#define C12IN1M                       333
#define INT1                          334
#define VREFM                         335
#define PA2                           336
#define PORTC_RC1                     337
#define PA1                           338
#define AN6                           339
#define INT2                          340
#define CVREF                         341
#define P1D                           342
#define C12IN2M                       343
#define PORTC_RC2                     344
#define AN7                           345
#define P1C                           346
#define PGM                           347
#define C12IN3M                       348
#define PORTC_RC3                     349
#define C12OUT                        350
#define P1B                           351
#define SRQ                           352
#define PORTC_RC4                     353
#define CCP1                          354
#define T0CKI                         355
#define P1A                           356
#define PORTC_RC5                     357
#define T1OSCI                        358
#define AN8                           359
#define T13CKI                        360
#define nSS                           361
#define NOT_SS                        362
#define SS                            363
#define PORTC_RC6                     364
#define T1OSCO                        365
#define AN9                           366
#define SDO                           367
#define PORTC_RC7                     368
#define LATA                          369
#define LATA4                         370
#define LA4                           371
#define LATA5                         372
#define LA5                           373
#define LATB                          374
#define LB4                           375
#define LATB4                         376
#define LB5                           377
#define LATB5                         378
#define LB6                           379
#define LATB6                         380
#define LB7                           381
#define LATB7                         382
#define LATC                          383
#define LATC0                         384
#define LC0                           385
#define LATC1                         386
#define LC1                           387
#define LATC2                         388
#define LC2                           389
#define LATC3                         390
#define LC3                           391
#define LATC4                         392
#define LC4                           393
#define LATC5                         394
#define LC5                           395
#define LATC6                         396
#define LC6                           397
#define LATC7                         398
#define LC7                           399
#define TRISA                         400
#define TRISA_RA4                     401
#define TRISA4                        402
#define TRISA_RA5                     403
#define TRISA5                        404
#define TRISB                         405
#define TRISB4                        406
#define TRISB_RB4                     407
#define TRISB5                        408
#define TRISB_RB5                     409
#define TRISB6                        410
#define TRISB_RB6                     411
#define TRISB7                        412
#define TRISB_RB7                     413
#define TRISC                         414
#define TRISC0                        415
#define TRISC_RC0                     416
#define TRISC1                        417
#define TRISC_RC1                     418
#define TRISC2                        419
#define TRISC_RC2                     420
#define TRISC3                        421
#define TRISC_RC3                     422
#define TRISC4                        423
#define TRISC_RC4                     424
#define TRISC5                        425
#define TRISC_RC5                     426
#define TRISC6                        427
#define TRISC_RC6                     428
#define TRISC7                        429
#define TRISC_RC7                     430
#define OSCTUNE                       431
#define TUN0                          432
#define TUN                           433
#define TUN1                          434
#define TUN2                          435
#define TUN3                          436
#define TUN4                          437
#define TUN5                          438
#define SPLLEN                        439
#define INTSRC                        440
#define PIE1                          441
#define TMR1IE                        442
#define TMR2IE                        443
#define CCP1IE                        444
#define SSPIE                         445
#define TXIE                          446
#define TX1IE                         447
#define RCIE                          448
#define RC1IE                         449
#define ADIE                          450
#define PIR1                          451
#define TMR1IF                        452
#define TMR2IF                        453
#define CCP1IF                        454
#define SSPIF                         455
#define TXIF                          456
#define TX1IF                         457
#define RCIF                          458
#define RC1IF                         459
#define ADIF                          460
#define IPR1                          461
#define TMR1IP                        462
#define TMR2IP                        463
#define CCP1IP                        464
#define SSPIP                         465
#define TX1IP                         466
#define TXIP                          467
#define RC1IP                         468
#define RCIP                          469
#define ADIP                          470
#define PIE2                          471
#define TMR3IE                        472
#define USBIE                         473
#define BCLIE                         474
#define EEIE                          475
#define C2IE                          476
#define C1IE                          477
#define CMIE                          478
#define OSCFIE                        479
#define PIR2                          480
#define TMR3IF                        481
#define USBIF                         482
#define BCLIF                         483
#define EEIF                          484
#define C2IF                          485
#define C1IF                          486
#define CMIF                          487
#define OSCFIF                        488
#define IPR2                          489
#define TMR3IP                        490
#define USBIP                         491
#define BCLIP                         492
#define EEIP                          493
#define C2IP                          494
#define C1IP                          495
#define CMIP                          496
#define OSCFIP                        497
#define EECON1                        498
#define RD                            499
#define WR                            500
#define WREN                          501
#define WRERR                         502
#define FREE                          503
#define CFGS                          504
#define EEFS                          505
#define EEPGD                         506
#define EEADR                         507
#define EEADR0                        508
#define EEADR1                        509
#define EEADR2                        510
#define EEADR3                        511
#define EEADR4                        512
#define EEADR5                        513
#define EEADR6                        514
#define EEADR7                        515
#define RCSTA                         516
#define RCD8                          517
#define RX9D                          518
#define OERR                          519
#define FERR                          520
#define ADDEN                         521
