tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf13k50_tdd.h
#define ADEN                          522
#define CREN                          523
#define SRENA                         524
#define SREN                          525
#define RC9                           526
#define RC8_9                         527
#define RX9                           528
#define SPEN                          529
#define TXSTA                         530
#define TXD8                          531
#define TX9D1                         532
#define TX9D                          533
#define TRMT                          534
#define TRMT1                         535
#define BRGH1                         536
#define BRGH                          537
#define SENDB1                        538
#define SENDB                         539
#define SYNC                          540
#define SYNC1                         541
#define TXEN1                         542
#define TXEN                          543
#define TX91                          544
#define TX8_9                         545
#define TX9                           546
#define CSRC1                         547
#define CSRC                          548
#define T3CON                         549
#define TMR3ON                        550
#define TMR3CS                        551
#define nT3SYNC                       552
#define NOT_T3SYNC                    553
#define T3SYNC                        554
#define SOSCEN3                       555
#define T3CCP1                        556
#define T3CKPS                        557
#define T3CKPS0                       558
#define T3CKPS1                       559
#define T3CON_RD16                    560
#define T3RD16                        561
#define RD163                         562
#define ECCP1AS                       563
#define PSSBD                         564
#define PSSBD0                        565
#define PSSBD1                        566
#define PSSAC                         567
#define PSSAC0                        568
#define PSSAC1                        569
#define ECCPAS0                       570
#define ECCPAS                        571
#define ECCPAS1                       572
#define ECCPAS2                       573
#define ECCPASE                       574
#define PWM1CON                       575
#define PDC0                          576
#define PDC                           577
#define PDC1                          578
#define PDC2                          579
#define PDC3                          580
#define PDC4                          581
#define PDC5                          582
#define PDC6                          583
#define PRSEN                         584
#define BAUDCON                       585
#define ABDEN                         586
#define W4E                           587
#define WUE                           588
#define BRG16                         589
#define SCKP                          590
#define CKTXP                         591
#define RXCKP                         592
#define DTRXP                         593
#define RCIDL                         594
#define ABDOVF                        595
#define PSTRCON                       596
#define STRA                          597
#define STRB                          598
#define STRC                          599
#define STRD                          600
#define STRSYNC                       601
#define REFCON0                       602
#define FVR1S0                        603
#define FVR1S1                        604
#define FVR1ST                        605
#define FVR1EN                        606
#define REFCON1                       607
#define D1NSS0                        608
#define D1NSS                         609
#define D1PSS                         610
#define D1PSS0                        611
#define D1PSS1                        612
#define DAC1OE                        613
#define D1LPS                         614
#define D1EN                          615
#define REFCON2                       616
#define DAC1R0                        617
#define DAC1R1                        618
#define DAC1R2                        619
#define DAC1R3                        620
#define DAC1R4                        621
#define CCP1CON                       622
#define CCP1M0                        623
#define CCP1M                         624
#define CCP1M1                        625
#define CCP1M2                        626
#define CCP1M3                        627
#define DC1B                          628
#define DC1B0                         629
#define DC1B1                         630
#define P1M                           631
#define P1M0                          632
#define P1M1                          633
#define ADCON2                        634
#define ADCS0                         635
#define ADCS                          636
#define ADCS1                         637
#define ADCS2                         638
#define ACQT0                         639
#define ACQT                          640
#define ACQT1                         641
#define ACQT2                         642
#define ADFM                          643
#define ADCON1                        644
#define NVCFG0                        645
#define NVCFG1                        646
#define PVCFG0                        647
#define CHSN3                         648
#define PVCFG1                        649
#define ADCON0                        650
#define ADON                          651
#define nDONE                         652
#define GO_nDONE                      653
#define NOT_DONE                      654
#define GODONE                        655
#define GO_DONE                       656
#define DONE                          657
#define GO_NOT_DONE                   658
#define GO                            659
#define CHS                           660
#define CHS0                          661
#define CHS1                          662
#define CHS2                          663
#define CHS3                          664
#define SSPCON2                       665
#define SEN                           666
#define RSEN                          667
#define PEN                           668
#define RCEN                          669
#define ACKEN                         670
#define ACKDT                         671
#define ACKSTAT                       672
#define GCEN                          673
#define SSPCON1                       674
#define SSPM0                         675
#define SSPM                          676
#define SSPM1                         677
#define SSPM2                         678
#define SSPM3                         679
#define CKP                           680
#define SSPEN                         681
#define SSPOV                         682
#define WCOL                          683
#define SSPSTAT                       684
#define BF                            685
#define UA                            686
#define R_NOT_W                       687
#define NOT_W                         688
#define nW                            689
#define RW                            690
#define nWRITE                        691
#define R                             692
#define W                             693
#define NOT_WRITE                     694
#define R_nW                          695
#define R_W                           696
#define START                         697
#define S                             698
#define STOP                          699
#define P                             700
#define A                             701
#define NOT_A                         702
#define nA                            703
#define D_A                           704
#define D_nA                          705
#define D                             706
#define DA                            707
#define D_NOT_A                       708
#define NOT_ADDRESS                   709
#define nADDRESS                      710
#define CKE                           711
#define SMP                           712
#define T2CON                         713
#define T2CKPS0                       714
#define T2CKPS                        715
#define T2CKPS1                       716
#define TMR2ON                        717
#define T2OUTPS0                      718
#define T2OUTPS                       719
#define T2OUTPS1                      720
#define T2OUTPS2                      721
#define T2OUTPS3                      722
#define PR2                           723
#define WM0                           724
#define WM1                           725
#define WAIT0                         726
#define WAIT1                         727
#define EBDIS                         728
#define T1CON                         729
#define TMR1ON                        730
#define TMR1CS                        731
#define NOT_T1SYNC                    732
#define T1SYNC                        733
#define nT1SYNC                       734
#define T1OSCEN                       735
#define SOSCEN                        736
#define T1CKPS0                       737
#define T1CKPS                        738
#define T1CKPS1                       739
#define T1RUN                         740
#define T1CON_RD16                    741
#define T1RD16                        742
#define RCON                          743
#define BOR                           744
#define NOT_BOR                       745
#define nBOR                          746
#define POR                           747
#define nPOR                          748
#define NOT_POR                       749
#define PD                            750
#define nPD                           751
#define NOT_PD                        752
#define NOT_TO                        753
#define nTO                           754
#define TO                            755
#define nRI                           756
#define NOT_RI                        757
#define RI                            758
#define SBOREN                        759
#define IPEN                          760
#define WDTCON                        761
#define SWDTE                         762
#define SWDTEN                        763
#define OSCCON2                       764
#define LFIOFS                        765
#define HFIOFL                        766
#define PRI_SD                        767
#define OSCCON                        768
#define SCS0                          769
#define SCS                           770
#define SCS1                          771
#define IOFS                          772
#define OSTS                          773
#define IRCF                          774
#define IRCF0                         775
#define IRCF1                         776
#define IRCF2                         777
#define IDLEN                         778
#define T0CON                         779
#define T0PS                          780
#define T0PS0                         781
#define T0PS1                         782
#define T0PS2                         783
#define PSA                           784
#define T0SE                          785
#define T0CS                          786
#define T08BIT                        787
#define TMR0ON                        788
#define STATUS                        789
#define C                             790
#define CARRY                         791
#define DC                            792
#define ZERO                          793
#define Z                             794
#define OV                            795
#define OVERFLOW                      796
#define N                             797
#define NEGATIVE                      798
#define INTCON3                       799
#define INT1IF                        800
#define INT1F                         801
#define INT2IF                        802
#define INT2F                         803
#define INT1E                         804
#define INT1IE                        805
#define INT2IE                        806
#define INT2E                         807
#define INT1P                         808
#define INT1IP                        809
#define INT2IP                        810
#define INT2P                         811
#define INTCON2                       812
#define RABIP                         813
#define TMR0IP                        814
#define INTEDG2                       815
#define INTEDG1                       816
#define INTEDG0                       817
#define nRABPU                        818
#define NOT_RABPU                     819
#define RABPU                         820
#define INTCON                        821
#define RABIF                         822
#define INT0F                         823
#define INT0IF                        824
#define T0IF                          825
#define TMR0IF                        826
#define RABIE                         827
#define INT0E                         828
#define INT0IE                        829
#define T0IE                          830
#define TMR0IE                        831
#define PEIE                          832
#define PEIE_GIEL                     833
#define GIEL                          834
#define GIE_GIEH                      835
#define GIE                           836
#define GIEH                          837
#define SP0                           838
#define STKPTR                        839
#define SP1                           840
#define SP2                           841
#define SP3                           842
#define SP4                           843
#define STKUNF                        844
#define STKOVF                        845
#define STKFUL                        846

#endif // _PIC18LF13K50_H_
